{
  "fintech": {
    "keywords": ["fintech", "payment", "banking", "financial", "money", "transaction", "wallet", "stripe", "plaid"],
    "contexts": [
      "Stripe is a payment processing platform used by millions of businesses worldwide. It offers APIs for accepting payments, managing subscriptions, and handling complex payment flows. Key features include: PCI-DSS Level 1 compliance, support for 135+ currencies, advanced fraud detection with Radar, and extensive developer documentation. Stripe Connect enables marketplace and platform payments.",
      "Plaid provides financial data APIs that connect apps to users' bank accounts. It enables services like account verification, balance checks, transaction history, and income verification. Plaid is used by fintech apps like Venmo, Robinhood, and Acorns. Security: bank-level 256-bit encryption, OAuth 2.0, and SOC 2 Type II certified.",
      "Fintech regulatory landscape: PCI-DSS compliance required for payment card processing, SOC 2 for data security, KYC (Know Your Customer) and AML (Anti-Money Laundering) regulations for banking services, and GDPR/CCPA for data privacy. Open Banking standards (PSD2 in EU, FDX in US) enable secure data sharing.",
      "Modern fintech stack: Next.js/React for frontend, FastAPI/Node.js for backend, PostgreSQL/MongoDB for databases, Redis for caching, Stripe/Plaid for financial APIs, AWS/GCP for cloud infrastructure, and Kubernetes for orchestration. Security tools: Vault for secrets, Auth0 for authentication, and Sentry for monitoring.",
      "Fintech business models: Transaction fees (2.9% + 30¢ per transaction is standard), subscription pricing (SaaS model), interchange fees (card networks), lending interest, and float income (interest on customer deposits). Common monetization: freemium tier, volume discounts, and premium features.",
      "Key fintech metrics: Monthly Recurring Revenue (MRR), Customer Acquisition Cost (CAC), Lifetime Value (LTV), LTV:CAC ratio (should be >3), Net Revenue Retention (>100% is good), Transaction Processing Volume (TPV), and Take Rate (revenue as % of TPV). Regulatory capital requirements vary by service type."
    ]
  },
  "healthcare": {
    "keywords": ["healthcare", "medical", "health", "patient", "doctor", "hospital", "clinical", "diagnosis", "ehr", "hipaa"],
    "contexts": [
      "HIPAA compliance is mandatory for healthcare apps handling Protected Health Information (PHI). Requirements: end-to-end encryption (AES-256), audit logs, access controls, Business Associate Agreements (BAAs), breach notification procedures, and annual security assessments. Non-compliance fines: $100-$50,000 per violation.",
      "Electronic Health Records (EHR) systems: Epic dominates large hospitals (54% market share), Cerner/Oracle Health for mid-size institutions, and Athenahealth for outpatient practices. EHR interoperability standards: HL7 FHIR (Fast Healthcare Interoperability Resources) is the modern API standard replacing older HL7 v2.",
      "FDA regulation applies to medical devices and clinical decision support software. Class I (low risk, e.g., bandages), Class II (moderate risk, e.g., blood pressure monitors, requires 510(k) clearance), Class III (high risk, e.g., pacemakers, requires PMA approval). SaMD (Software as a Medical Device) regulations apply to diagnostic/treatment apps.",
      "Healthcare tech stack: React/Vue for frontend, Python/FastAPI for backend (preferred for ML integration), PostgreSQL with encryption for PHI, Redis for caching (non-PHI only), AWS GovCloud or Azure Healthcare for HIPAA-compliant hosting, and Twilio Healthcare for HIPAA-compliant messaging.",
      "Healthcare business models: B2B (sell to hospitals/clinics), B2C (direct-to-consumer telehealth), B2B2C (partner with providers), value-based care contracts (paid for outcomes), and fee-for-service. Revenue: subscription fees ($50-500/provider/month), per-consultation ($25-100), and insurance reimbursement (CPT codes).",
      "Key healthcare metrics: Patient Acquisition Cost (PAC), Patient Lifetime Value (PLV), No-Show Rate (<10% is good), Patient Satisfaction Score (NPS >50), Provider Utilization Rate (75-85% optimal), and Clinical Outcomes (readmission rates, treatment success rates). Compliance audit pass rate should be 100%."
    ]
  },
  "ecommerce": {
    "keywords": ["ecommerce", "online store", "shopping", "retail", "marketplace", "shopify", "woocommerce", "product"],
    "contexts": [
      "Ecommerce platforms: Shopify dominates with 26% market share (4.4M+ stores), WooCommerce (WordPress plugin) powers 23% of online stores, Magento/Adobe Commerce for enterprise, BigCommerce for mid-market, and custom solutions with Next.js + headless CMS. Shopify Plus for high-volume stores ($2,000+/mo).",
      "Payment gateway comparison: Stripe (2.9% + 30¢, best developer experience), PayPal (2.9% + 30¢, highest customer trust), Square (2.6% + 10¢, best for in-person + online), Authorize.net (2.9% + 30¢, oldest/most integrations). Multi-currency support essential for global sales.",
      "Ecommerce tech stack: Next.js/React for storefront (SSR for SEO), Shopify/BigCommerce APIs for backend, Algolia for product search, Cloudinary for image optimization, Stripe for payments, Shippo/ShipStation for shipping, and Klaviyo/Mailchimp for email marketing. CDN: Cloudflare or AWS CloudFront.",
      "Inventory management: Shopify built-in for simple stores, Cin7/TradeGecko for multi-channel, NetSuite for enterprise. Real-time sync across channels (web, mobile, retail) critical. Dropshipping: Oberlo/Spocket integration. Warehouse management: Fulfillment by Amazon (FBA) or third-party logistics (3PL).",
      "Ecommerce business models: Direct-to-Consumer (DTC, high margins 40-60%), Dropshipping (low margins 10-20%, no inventory risk), Subscription boxes (predictable revenue, 5-10% monthly churn), Marketplace (commission 10-20% per sale), and Wholesale (B2B, bulk orders). VC-funded DTC brands target $1M ARR in Year 1.",
      "Key ecommerce metrics: Conversion Rate (1-3% is average, >3% is good), Average Order Value (AOV, increase with upsells/bundles), Cart Abandonment Rate (69% industry average, recover with email), Customer Lifetime Value (CLV, should be >3x CAC), Gross Margin (40-60% for DTC), and Inventory Turnover (4-6 times/year)."
    ]
  },
  "saas": {
    "keywords": ["saas", "software", "subscription", "platform", "b2b", "enterprise", "api", "cloud"],
    "contexts": [
      "SaaS tech stack: Next.js/React for frontend, FastAPI/Node.js for backend, PostgreSQL for relational data, Redis for caching/session storage, Stripe for billing, Auth0/Supabase Auth for authentication, AWS/Vercel for hosting, and Sentry for error tracking. Multi-tenancy: schema-per-tenant or row-level security (RLS).",
      "SaaS pricing models: Freemium (free tier + paid upgrades), Per-seat pricing ($10-100/user/month), Usage-based (pay-per-API-call or storage), Tiered pricing (Starter/Pro/Enterprise), and Flat-rate pricing (simple, unlimited users). Annual plans (15-20% discount) improve cash flow and retention.",
      "SaaS metrics: Monthly Recurring Revenue (MRR), Annual Recurring Revenue (ARR), Customer Acquisition Cost (CAC, should be <$1,000 for SMB SaaS), Lifetime Value (LTV, should be >3x CAC), Churn Rate (annual <5% is good, <10% acceptable, >15% bad), Net Revenue Retention (>100% means expansion revenue > churn).",
      "SaaS sales model: Product-Led Growth (PLG, users sign up and upgrade themselves, low CAC), Sales-Led Growth (SLG, enterprise deals, high ACV >$100k), or Hybrid. Sales cycle: SMB 1-3 months, Mid-market 3-6 months, Enterprise 6-18 months. Conversion funnel: Trial → Paid (20-40% good for PLG).",
      "SaaS infrastructure: Multi-region deployment for low latency, Auto-scaling for traffic spikes, Database replication for high availability, Daily backups with point-in-time recovery, Rate limiting to prevent abuse, API versioning for backward compatibility, and Monitoring (Datadog/New Relic for observability).",
      "SaaS go-to-market: Inbound marketing (SEO, content marketing, $50-200 CAC), Outbound sales (cold email/LinkedIn, $500-2000 CAC), Partnerships (integrations, co-marketing), and Community-led growth (Discord/Slack communities). Product-market fit: >40% users would be 'very disappointed' if product disappeared."
    ]
  },
  "ai": {
    "keywords": ["ai", "machine learning", "artificial intelligence", "ml", "llm", "gpt", "openai", "anthropic", "neural", "model"],
    "contexts": [
      "LLM provider comparison: OpenAI GPT-4 ($30/1M tokens, most capable), Anthropic Claude ($15/1M tokens, best for long context), Google Gemini ($7/1M tokens, multimodal), Open-source models (Llama 3, Mistral, free but self-hosted). API latency: 2-10 seconds for 1000 tokens. Fine-tuning: $0.50-2.00/1M tokens.",
      "AI tech stack: LangChain/LlamaIndex for orchestration, Pinecone/Qdrant/Chroma for vector databases, Sentence-Transformers for embeddings (all-MiniLM-L6-v2 is fast, text-embedding-3-large is best), Hugging Face for model hosting, Modal/Replicate for GPU inference, and Weights & Biases for experiment tracking.",
      "RAG (Retrieval-Augmented Generation) architecture: User query → Embed query → Vector search (cosine similarity) → Retrieve top-k chunks → Inject into LLM prompt → Generate response. Improves accuracy, reduces hallucination, and enables real-time data. Embedding dimensions: 384 (fast) to 1536 (accurate).",
      "AI product patterns: Chatbots (customer support, $0.10-1.00/conversation), Document analysis (summarization, Q&A, $0.50-5.00/document), Code generation (Copilot-style, $10-20/user/month), Content creation (blog posts, ads, $0.10-1.00/generation), and Personalization (recommendations, $0.01-0.10/user).",
      "AI infrastructure: GPU: NVIDIA A100 ($2-4/hour), H100 ($8-12/hour), or T4 ($0.50-1/hour for inference). Frameworks: PyTorch (research/training), ONNX Runtime (production inference), vLLM (high-throughput LLM serving). Model optimization: quantization (4-bit for 4x speedup), pruning, and distillation.",
      "AI metrics: Model accuracy (BLEU for translation, F1 for classification, Rouge for summarization), Inference latency (p50, p95, p99 response times), Tokens per second (throughput), Cost per query ($0.001-0.10), User satisfaction (thumbs up/down, 70%+ good), and Hallucination rate (<5% for production)."
    ]
  },
  "blockchain": {
    "keywords": ["blockchain", "crypto", "web3", "ethereum", "bitcoin", "defi", "nft", "smart contract", "dapp"],
    "contexts": [
      "Blockchain platforms: Ethereum (most dApps, high gas fees $1-50/tx), Polygon (Ethereum L2, low fees $0.01/tx), Solana (fast, 400ms blocks, $0.0001/tx), Arbitrum/Optimism (Ethereum L2s), and Avalanche (subnets for custom chains). Smart contract languages: Solidity (Ethereum), Rust (Solana), Move (Aptos).",
      "Web3 tech stack: ethers.js/viem for blockchain interaction, Hardhat/Foundry for smart contract development, IPFS/Arweave for decentralized storage, The Graph for indexing blockchain data, WalletConnect/RainbowKit for wallet integration, and Alchemy/Infura for node RPC endpoints. Testnets: Sepolia, Goerli.",
      "DeFi primitives: DEX (Decentralized Exchange, Uniswap protocol, 0.3% swap fee), Lending (Aave, Compound, 2-10% APY for lenders, 5-20% for borrowers), Stablecoins (USDC, DAI, 1:1 USD peg), Yield farming (provide liquidity for rewards), and Staking (lock tokens for network security, 4-15% APY).",
      "NFT infrastructure: ERC-721 (unique NFTs) and ERC-1155 (semi-fungible tokens) standards, OpenSea SDK for marketplace integration, Pinata/NFT.Storage for IPFS pinning, Chainlink VRF for random traits, and Manifold for custom smart contracts. Royalties: 5-10% on secondary sales (enforced off-chain).",
      "Blockchain business models: Transaction fees (0.1-0.5% per trade for DEXs), Protocol-owned liquidity (earn trading fees), Governance token distribution (incentivize early users), NFT minting fees ($50-200/mint), and Subscription for premium features. Fundraising: Token sales (ICO/IDO), VC funding, or grants (Ethereum Foundation).",
      "Web3 metrics: Total Value Locked (TVL, sum of assets in protocol), Daily Active Users (DAU, unique wallet addresses), Transaction volume, Token price and market cap, Liquidity depth, Governance participation rate, and Protocol revenue. Gas optimization: minimize storage writes, use events instead of storage for logs."
    ]
  },
  "devtools": {
    "keywords": ["developer tools", "devtools", "api", "sdk", "cli", "infrastructure", "monitoring", "cicd", "platform"],
    "contexts": [
      "Developer platform stack: GitHub (code hosting, CI/CD), Vercel (frontend deployment, $20-150/month), Railway/Render (backend hosting, $5-50/month), Supabase (Postgres + Auth, $25-2000/month), Stripe (payments), Sentry (error tracking, $26-80/month), and Datadog/New Relic (APM, $15-31/host/month).",
      "API design best practices: REST for CRUD operations, GraphQL for flexible data fetching, gRPC for microservices, WebSockets for real-time. Versioning: URL path (/v1/) or header. Authentication: OAuth 2.0 for user auth, API keys for server-to-server. Rate limiting: 100-1000 req/min for free tier, 10k+ for paid.",
      "Developer tools business model: Freemium (free tier for individuals, $20-500/month for teams), Usage-based (pay per API call, GB, user), Developer-first GTM (excellent docs, SDKs in 5+ languages, active community), and Product-Led Growth (quick onboarding, clear value in <5 minutes).",
      "DevTools metrics: API uptime (99.9%+ required), Latency (p50 <100ms, p99 <500ms), Time-to-first-hello-world (<5 minutes ideal), API error rate (<0.1%), Developer NPS (>50 is good), Activation rate (% of signups who make first API call, >40% good), and API calls per developer (indicates stickiness).",
      "CLI/SDK design: Support Node.js, Python, Go, Ruby, Java as minimum. Package managers: npm, pip, go get, gem. CLI: use Click (Python), Commander (Node), Cobra (Go). Docs: OpenAPI/Swagger spec, interactive API explorer, code examples in all languages, and error message quality (actionable guidance).",
      "Infrastructure monitoring: Prometheus + Grafana (metrics), Elasticsearch + Kibana (logs), Jaeger/Zipkin (distributed tracing), PagerDuty/Opsgenie (alerting), and Statuspage (public status). SLIs: latency, error rate, saturation. SLOs: 99.9% uptime = 43 minutes downtime/month allowed."
    ]
  }
}

